TomSievers/DAPLink/source/hic_hal/raspberry/rp2040/hal/include/uart_regs.h
#include "addrmap.h"

// =============================================================================
// Register block : UART
// Version        : 1
// Bus type       : apb
// Description    : None
// =============================================================================
#ifndef HARDWARE_REGS_UART_DEFINED
#define HARDWARE_REGS_UART_DEFINED
// =============================================================================
// Register    : UART_UARTDR
// Description : Data Register, UARTDR
#define UART_UARTDR_OFFSET _u(0x00000000)
#define UART_UARTDR_BITS   _u(0x00000fff)
#define UART_UARTDR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTDR_OE
// Description : Overrun error. This bit is set to 1 if data is received and the
//               receive FIFO is already full. This is cleared to 0 once there
//               is an empty space in the FIFO and a new character can be
//               written to it.
#define UART_UARTDR_OE_RESET  "-"
#define UART_UARTDR_OE_BITS   _u(0x00000800)
#define UART_UARTDR_OE_MSB    _u(11)
#define UART_UARTDR_OE_LSB    _u(11)
#define UART_UARTDR_OE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTDR_BE
// Description : Break error. This bit is set to 1 if a break condition was
//               detected, indicating that the received data input was held LOW
//               for longer than a full-word transmission time (defined as
//               start, data, parity and stop bits). In FIFO mode, this error is
//               associated with the character at the top of the FIFO. When a
//               break occurs, only one 0 character is loaded into the FIFO. The
//               next character is only enabled after the receive data input
//               goes to a 1 (marking state), and the next valid start bit is
//               received.
#define UART_UARTDR_BE_RESET  "-"
#define UART_UARTDR_BE_BITS   _u(0x00000400)
#define UART_UARTDR_BE_MSB    _u(10)
#define UART_UARTDR_BE_LSB    _u(10)
#define UART_UARTDR_BE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTDR_PE
// Description : Parity error. When set to 1, it indicates that the parity of
//               the received data character does not match the parity that the
//               EPS and SPS bits in the Line Control Register, UARTLCR_H. In
//               FIFO mode, this error is associated with the character at the
//               top of the FIFO.
#define UART_UARTDR_PE_RESET  "-"
#define UART_UARTDR_PE_BITS   _u(0x00000200)
#define UART_UARTDR_PE_MSB    _u(9)
#define UART_UARTDR_PE_LSB    _u(9)
#define UART_UARTDR_PE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTDR_FE
// Description : Framing error. When set to 1, it indicates that the received
//               character did not have a valid stop bit (a valid stop bit is
//               1). In FIFO mode, this error is associated with the character
//               at the top of the FIFO.
#define UART_UARTDR_FE_RESET  "-"
#define UART_UARTDR_FE_BITS   _u(0x00000100)
#define UART_UARTDR_FE_MSB    _u(8)
#define UART_UARTDR_FE_LSB    _u(8)
#define UART_UARTDR_FE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTDR_DATA
// Description : Receive (read) data character. Transmit (write) data character.
#define UART_UARTDR_DATA_RESET  "-"
#define UART_UARTDR_DATA_BITS   _u(0x000000ff)
#define UART_UARTDR_DATA_MSB    _u(7)
#define UART_UARTDR_DATA_LSB    _u(0)
#define UART_UARTDR_DATA_ACCESS "RWF"
// =============================================================================
// Register    : UART_UARTRSR
// Description : Receive Status Register/Error Clear Register, UARTRSR/UARTECR
#define UART_UARTRSR_OFFSET _u(0x00000004)
#define UART_UARTRSR_BITS   _u(0x0000000f)
#define UART_UARTRSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTRSR_OE
// Description : Overrun error. This bit is set to 1 if data is received and the
//               FIFO is already full. This bit is cleared to 0 by a write to
//               UARTECR. The FIFO contents remain valid because no more data is
//               written when the FIFO is full, only the contents of the shift
//               register are overwritten. The CPU must now read the data, to
//               empty the FIFO.
#define UART_UARTRSR_OE_RESET  _u(0x0)
#define UART_UARTRSR_OE_BITS   _u(0x00000008)
#define UART_UARTRSR_OE_MSB    _u(3)
#define UART_UARTRSR_OE_LSB    _u(3)
#define UART_UARTRSR_OE_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRSR_BE
// Description : Break error. This bit is set to 1 if a break condition was
//               detected, indicating that the received data input was held LOW
//               for longer than a full-word transmission time (defined as
//               start, data, parity, and stop bits). This bit is cleared to 0
//               after a write to UARTECR. In FIFO mode, this error is
//               associated with the character at the top of the FIFO. When a
//               break occurs, only one 0 character is loaded into the FIFO. The
//               next character is only enabled after the receive data input
//               goes to a 1 (marking state) and the next valid start bit is
//               received.
#define UART_UARTRSR_BE_RESET  _u(0x0)
#define UART_UARTRSR_BE_BITS   _u(0x00000004)
#define UART_UARTRSR_BE_MSB    _u(2)
#define UART_UARTRSR_BE_LSB    _u(2)
#define UART_UARTRSR_BE_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRSR_PE
// Description : Parity error. When set to 1, it indicates that the parity of
//               the received data character does not match the parity that the
//               EPS and SPS bits in the Line Control Register, UARTLCR_H. This
//               bit is cleared to 0 by a write to UARTECR. In FIFO mode, this
//               error is associated with the character at the top of the FIFO.
#define UART_UARTRSR_PE_RESET  _u(0x0)
#define UART_UARTRSR_PE_BITS   _u(0x00000002)
#define UART_UARTRSR_PE_MSB    _u(1)
#define UART_UARTRSR_PE_LSB    _u(1)
#define UART_UARTRSR_PE_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRSR_FE
// Description : Framing error. When set to 1, it indicates that the received
//               character did not have a valid stop bit (a valid stop bit is
//               1). This bit is cleared to 0 by a write to UARTECR. In FIFO
//               mode, this error is associated with the character at the top of
//               the FIFO.
#define UART_UARTRSR_FE_RESET  _u(0x0)
#define UART_UARTRSR_FE_BITS   _u(0x00000001)
#define UART_UARTRSR_FE_MSB    _u(0)
#define UART_UARTRSR_FE_LSB    _u(0)
#define UART_UARTRSR_FE_ACCESS "WC"
// =============================================================================
// Register    : UART_UARTFR
// Description : Flag Register, UARTFR
#define UART_UARTFR_OFFSET _u(0x00000018)
#define UART_UARTFR_BITS   _u(0x000001ff)
#define UART_UARTFR_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_RI
// Description : Ring indicator. This bit is the complement of the UART ring
//               indicator, nUARTRI, modem status input. That is, the bit is 1
//               when nUARTRI is LOW.
#define UART_UARTFR_RI_RESET  "-"
#define UART_UARTFR_RI_BITS   _u(0x00000100)
#define UART_UARTFR_RI_MSB    _u(8)
#define UART_UARTFR_RI_LSB    _u(8)
#define UART_UARTFR_RI_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_TXFE
// Description : Transmit FIFO empty. The meaning of this bit depends on the
//               state of the FEN bit in the Line Control Register, UARTLCR_H.
//               If the FIFO is disabled, this bit is set when the transmit
//               holding register is empty. If the FIFO is enabled, the TXFE bit
//               is set when the transmit FIFO is empty. This bit does not
//               indicate if there is data in the transmit shift register.
#define UART_UARTFR_TXFE_RESET  _u(0x1)
#define UART_UARTFR_TXFE_BITS   _u(0x00000080)
#define UART_UARTFR_TXFE_MSB    _u(7)
#define UART_UARTFR_TXFE_LSB    _u(7)
#define UART_UARTFR_TXFE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_RXFF
// Description : Receive FIFO full. The meaning of this bit depends on the state
//               of the FEN bit in the UARTLCR_H Register. If the FIFO is
//               disabled, this bit is set when the receive holding register is
//               full. If the FIFO is enabled, the RXFF bit is set when the
//               receive FIFO is full.
#define UART_UARTFR_RXFF_RESET  _u(0x0)
#define UART_UARTFR_RXFF_BITS   _u(0x00000040)
#define UART_UARTFR_RXFF_MSB    _u(6)
#define UART_UARTFR_RXFF_LSB    _u(6)
#define UART_UARTFR_RXFF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_TXFF
// Description : Transmit FIFO full. The meaning of this bit depends on the
//               state of the FEN bit in the UARTLCR_H Register. If the FIFO is
//               disabled, this bit is set when the transmit holding register is
//               full. If the FIFO is enabled, the TXFF bit is set when the
//               transmit FIFO is full.
#define UART_UARTFR_TXFF_RESET  _u(0x0)
#define UART_UARTFR_TXFF_BITS   _u(0x00000020)
#define UART_UARTFR_TXFF_MSB    _u(5)
#define UART_UARTFR_TXFF_LSB    _u(5)
#define UART_UARTFR_TXFF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_RXFE
// Description : Receive FIFO empty. The meaning of this bit depends on the
//               state of the FEN bit in the UARTLCR_H Register. If the FIFO is
//               disabled, this bit is set when the receive holding register is
//               empty. If the FIFO is enabled, the RXFE bit is set when the
//               receive FIFO is empty.
#define UART_UARTFR_RXFE_RESET  _u(0x1)
#define UART_UARTFR_RXFE_BITS   _u(0x00000010)
#define UART_UARTFR_RXFE_MSB    _u(4)
#define UART_UARTFR_RXFE_LSB    _u(4)
#define UART_UARTFR_RXFE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_BUSY
// Description : UART busy. If this bit is set to 1, the UART is busy
//               transmitting data. This bit remains set until the complete
//               byte, including all the stop bits, has been sent from the shift
//               register. This bit is set as soon as the transmit FIFO becomes
//               non-empty, regardless of whether the UART is enabled or not.
#define UART_UARTFR_BUSY_RESET  _u(0x0)
#define UART_UARTFR_BUSY_BITS   _u(0x00000008)
#define UART_UARTFR_BUSY_MSB    _u(3)
#define UART_UARTFR_BUSY_LSB    _u(3)
#define UART_UARTFR_BUSY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_DCD
// Description : Data carrier detect. This bit is the complement of the UART
//               data carrier detect, nUARTDCD, modem status input. That is, the
//               bit is 1 when nUARTDCD is LOW.
#define UART_UARTFR_DCD_RESET  "-"
#define UART_UARTFR_DCD_BITS   _u(0x00000004)
#define UART_UARTFR_DCD_MSB    _u(2)
#define UART_UARTFR_DCD_LSB    _u(2)
#define UART_UARTFR_DCD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_DSR
// Description : Data set ready. This bit is the complement of the UART data set
//               ready, nUARTDSR, modem status input. That is, the bit is 1 when
//               nUARTDSR is LOW.
#define UART_UARTFR_DSR_RESET  "-"
#define UART_UARTFR_DSR_BITS   _u(0x00000002)
#define UART_UARTFR_DSR_MSB    _u(1)
#define UART_UARTFR_DSR_LSB    _u(1)
#define UART_UARTFR_DSR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTFR_CTS
// Description : Clear to send. This bit is the complement of the UART clear to
//               send, nUARTCTS, modem status input. That is, the bit is 1 when
//               nUARTCTS is LOW.
#define UART_UARTFR_CTS_RESET  "-"
#define UART_UARTFR_CTS_BITS   _u(0x00000001)
#define UART_UARTFR_CTS_MSB    _u(0)
#define UART_UARTFR_CTS_LSB    _u(0)
#define UART_UARTFR_CTS_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTILPR
// Description : IrDA Low-Power Counter Register, UARTILPR
#define UART_UARTILPR_OFFSET _u(0x00000020)
#define UART_UARTILPR_BITS   _u(0x000000ff)
#define UART_UARTILPR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTILPR_ILPDVSR
// Description : 8-bit low-power divisor value. These bits are cleared to 0 at
//               reset.
#define UART_UARTILPR_ILPDVSR_RESET  _u(0x00)
#define UART_UARTILPR_ILPDVSR_BITS   _u(0x000000ff)
#define UART_UARTILPR_ILPDVSR_MSB    _u(7)
#define UART_UARTILPR_ILPDVSR_LSB    _u(0)
#define UART_UARTILPR_ILPDVSR_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTIBRD
// Description : Integer Baud Rate Register, UARTIBRD
#define UART_UARTIBRD_OFFSET _u(0x00000024)
#define UART_UARTIBRD_BITS   _u(0x0000ffff)
#define UART_UARTIBRD_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTIBRD_BAUD_DIVINT
// Description : The integer baud rate divisor. These bits are cleared to 0 on
//               reset.
#define UART_UARTIBRD_BAUD_DIVINT_RESET  _u(0x0000)
#define UART_UARTIBRD_BAUD_DIVINT_BITS   _u(0x0000ffff)
#define UART_UARTIBRD_BAUD_DIVINT_MSB    _u(15)
#define UART_UARTIBRD_BAUD_DIVINT_LSB    _u(0)
#define UART_UARTIBRD_BAUD_DIVINT_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTFBRD
// Description : Fractional Baud Rate Register, UARTFBRD
#define UART_UARTFBRD_OFFSET _u(0x00000028)
#define UART_UARTFBRD_BITS   _u(0x0000003f)
#define UART_UARTFBRD_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTFBRD_BAUD_DIVFRAC
// Description : The fractional baud rate divisor. These bits are cleared to 0
//               on reset.
#define UART_UARTFBRD_BAUD_DIVFRAC_RESET  _u(0x00)
#define UART_UARTFBRD_BAUD_DIVFRAC_BITS   _u(0x0000003f)
#define UART_UARTFBRD_BAUD_DIVFRAC_MSB    _u(5)
#define UART_UARTFBRD_BAUD_DIVFRAC_LSB    _u(0)
#define UART_UARTFBRD_BAUD_DIVFRAC_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTLCR_H
// Description : Line Control Register, UARTLCR_H
#define UART_UARTLCR_H_OFFSET _u(0x0000002c)
#define UART_UARTLCR_H_BITS   _u(0x000000ff)
#define UART_UARTLCR_H_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_SPS
// Description : Stick parity select. 0 = stick parity is disabled 1 = either: *
//               if the EPS bit is 0 then the parity bit is transmitted and
//               checked as a 1 * if the EPS bit is 1 then the parity bit is
//               transmitted and checked as a 0. This bit has no effect when the
//               PEN bit disables parity checking and generation.
#define UART_UARTLCR_H_SPS_RESET  _u(0x0)
#define UART_UARTLCR_H_SPS_BITS   _u(0x00000080)
#define UART_UARTLCR_H_SPS_MSB    _u(7)
#define UART_UARTLCR_H_SPS_LSB    _u(7)
#define UART_UARTLCR_H_SPS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_WLEN
// Description : Word length. These bits indicate the number of data bits
//               transmitted or received in a frame as follows: b11 = 8 bits b10
//               = 7 bits b01 = 6 bits b00 = 5 bits.
#define UART_UARTLCR_H_WLEN_RESET  _u(0x0)
#define UART_UARTLCR_H_WLEN_BITS   _u(0x00000060)
#define UART_UARTLCR_H_WLEN_MSB    _u(6)
#define UART_UARTLCR_H_WLEN_LSB    _u(5)
#define UART_UARTLCR_H_WLEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_FEN
// Description : Enable FIFOs: 0 = FIFOs are disabled (character mode) that is,
//               the FIFOs become 1-byte-deep holding registers 1 = transmit and
//               receive FIFO buffers are enabled (FIFO mode).
#define UART_UARTLCR_H_FEN_RESET  _u(0x0)
#define UART_UARTLCR_H_FEN_BITS   _u(0x00000010)
#define UART_UARTLCR_H_FEN_MSB    _u(4)
#define UART_UARTLCR_H_FEN_LSB    _u(4)
#define UART_UARTLCR_H_FEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_STP2
// Description : Two stop bits select. If this bit is set to 1, two stop bits
//               are transmitted at the end of the frame. The receive logic does
//               not check for two stop bits being received.
#define UART_UARTLCR_H_STP2_RESET  _u(0x0)
#define UART_UARTLCR_H_STP2_BITS   _u(0x00000008)
#define UART_UARTLCR_H_STP2_MSB    _u(3)
#define UART_UARTLCR_H_STP2_LSB    _u(3)
#define UART_UARTLCR_H_STP2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_EPS
// Description : Even parity select. Controls the type of parity the UART uses
//               during transmission and reception: 0 = odd parity. The UART
//               generates or checks for an odd number of 1s in the data and
//               parity bits. 1 = even parity. The UART generates or checks for
//               an even number of 1s in the data and parity bits. This bit has
//               no effect when the PEN bit disables parity checking and
//               generation.
#define UART_UARTLCR_H_EPS_RESET  _u(0x0)
#define UART_UARTLCR_H_EPS_BITS   _u(0x00000004)
#define UART_UARTLCR_H_EPS_MSB    _u(2)
#define UART_UARTLCR_H_EPS_LSB    _u(2)
#define UART_UARTLCR_H_EPS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_PEN
// Description : Parity enable: 0 = parity is disabled and no parity bit added
//               to the data frame 1 = parity checking and generation is
//               enabled.
#define UART_UARTLCR_H_PEN_RESET  _u(0x0)
#define UART_UARTLCR_H_PEN_BITS   _u(0x00000002)
#define UART_UARTLCR_H_PEN_MSB    _u(1)
#define UART_UARTLCR_H_PEN_LSB    _u(1)
#define UART_UARTLCR_H_PEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTLCR_H_BRK
// Description : Send break. If this bit is set to 1, a low-level is continually
//               output on the UARTTXD output, after completing transmission of
//               the current character. For the proper execution of the break
//               command, the software must set this bit for at least two
//               complete frames. For normal use, this bit must be cleared to 0.
#define UART_UARTLCR_H_BRK_RESET  _u(0x0)
#define UART_UARTLCR_H_BRK_BITS   _u(0x00000001)
#define UART_UARTLCR_H_BRK_MSB    _u(0)
#define UART_UARTLCR_H_BRK_LSB    _u(0)
#define UART_UARTLCR_H_BRK_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTCR
// Description : Control Register, UARTCR
#define UART_UARTCR_OFFSET _u(0x00000030)
#define UART_UARTCR_BITS   _u(0x0000ff87)
#define UART_UARTCR_RESET  _u(0x00000300)
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_CTSEN
// Description : CTS hardware flow control enable. If this bit is set to 1, CTS
//               hardware flow control is enabled. Data is only transmitted when
//               the nUARTCTS signal is asserted.
#define UART_UARTCR_CTSEN_RESET  _u(0x0)
#define UART_UARTCR_CTSEN_BITS   _u(0x00008000)
#define UART_UARTCR_CTSEN_MSB    _u(15)
#define UART_UARTCR_CTSEN_LSB    _u(15)
#define UART_UARTCR_CTSEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_RTSEN
// Description : RTS hardware flow control enable. If this bit is set to 1, RTS
//               hardware flow control is enabled. Data is only requested when
//               there is space in the receive FIFO for it to be received.
#define UART_UARTCR_RTSEN_RESET  _u(0x0)
#define UART_UARTCR_RTSEN_BITS   _u(0x00004000)
#define UART_UARTCR_RTSEN_MSB    _u(14)
#define UART_UARTCR_RTSEN_LSB    _u(14)
#define UART_UARTCR_RTSEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_OUT2
// Description : This bit is the complement of the UART Out2 (nUARTOut2) modem
//               status output. That is, when the bit is programmed to a 1, the
//               output is 0. For DTE this can be used as Ring Indicator (RI).
#define UART_UARTCR_OUT2_RESET  _u(0x0)
#define UART_UARTCR_OUT2_BITS   _u(0x00002000)
#define UART_UARTCR_OUT2_MSB    _u(13)
#define UART_UARTCR_OUT2_LSB    _u(13)
#define UART_UARTCR_OUT2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_OUT1
// Description : This bit is the complement of the UART Out1 (nUARTOut1) modem
//               status output. That is, when the bit is programmed to a 1 the
//               output is 0. For DTE this can be used as Data Carrier Detect
//               (DCD).
#define UART_UARTCR_OUT1_RESET  _u(0x0)
#define UART_UARTCR_OUT1_BITS   _u(0x00001000)
#define UART_UARTCR_OUT1_MSB    _u(12)
#define UART_UARTCR_OUT1_LSB    _u(12)
#define UART_UARTCR_OUT1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_RTS
// Description : Request to send. This bit is the complement of the UART request
//               to send, nUARTRTS, modem status output. That is, when the bit
//               is programmed to a 1 then nUARTRTS is LOW.
#define UART_UARTCR_RTS_RESET  _u(0x0)
#define UART_UARTCR_RTS_BITS   _u(0x00000800)
#define UART_UARTCR_RTS_MSB    _u(11)
#define UART_UARTCR_RTS_LSB    _u(11)
#define UART_UARTCR_RTS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_DTR
// Description : Data transmit ready. This bit is the complement of the UART
//               data transmit ready, nUARTDTR, modem status output. That is,
//               when the bit is programmed to a 1 then nUARTDTR is LOW.
#define UART_UARTCR_DTR_RESET  _u(0x0)
#define UART_UARTCR_DTR_BITS   _u(0x00000400)
#define UART_UARTCR_DTR_MSB    _u(10)
#define UART_UARTCR_DTR_LSB    _u(10)
#define UART_UARTCR_DTR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_RXE
// Description : Receive enable. If this bit is set to 1, the receive section of
//               the UART is enabled. Data reception occurs for either UART
//               signals or SIR signals depending on the setting of the SIREN
//               bit. When the UART is disabled in the middle of reception, it
